jakubczaplicki/everblu-meters-esp8266-improved/src/everblu-meters-esp8266.cpp
/*
 * Project: EverBlu Meters ESP8266/ESP32
 * Description: Fetch water/gas usage data from Itron EverBlu Cyble Enhanced RF water meters using the RADIAN protocol on 433 MHz.
 *              Integrated with Home Assistant via MQTT AutoDiscovery.
 * Author: Forked and improved by Genestealer, based on work by Psykokwak and Neutrinus.
 * License: Unknown (refer to the README for details).
 * 
 * Hardware Requirements:
 * - ESP8266/ESP32
 * - CC1101 RF Transceiver
 * 
 * Features:
 * - MQTT integration for Home Assistant
 * - Frequency discovery for meter communication
 * - Wi-Fi diagnostics and OTA updates
 * - Daily scheduled meter readings
 * 
 * For more details, refer to the README file.
 */

#include "private.h"        // Include private configuration (Wi-Fi, MQTT, etc.)
#include "everblu_meters.h" // Include EverBlu meter communication library
#include <ESP8266WiFi.h>    // Wi-Fi library for ESP8266
#include <ESP8266mDNS.h>    // mDNS library for ESP8266
#include <Arduino.h>        // Core Arduino library
#include <ArduinoOTA.h>     // OTA update library
#include <EspMQTTClient.h>  // MQTT client library

// Define the LED_BUILTIN pin if missing
#ifndef LED_BUILTIN
#define LED_BUILTIN 2 // Change this pin if needed
#endif

// Define the Wi-Fi PHY mode if missing from the private.h file
#ifndef ENABLE_WIFI_PHY_MODE_11G
#define ENABLE_WIFI_PHY_MODE_11G 0  // Set to 1 to enable 11G PHY mode
#endif

// Define the 433MHZ scan mode if missing from the private.h file
#ifndef SCAN_FREQUENCY_433MHZ
#define SCAN_FREQUENCY_433MHZ 0 // Set to 1 to enable frequency scanning
#endif

// Define the default reading schedule if missing from the private.h file.
// Options: "Monday-Friday", "Monday-Saturday", or "Monday-Sunday"
#ifndef DEFAULT_READING_SCHEDULE
#define DEFAULT_READING_SCHEDULE "Monday-Friday"
#endif

unsigned long lastWifiUpdate = 0;
unsigned long lastRetryAttempt = 0;
bool retryPending = false;
unsigned long cooldownEndTime = 0;  // End time for 1-hour cooldown period
const unsigned long COOLDOWN_PERIOD = 3600000; // 1 hour in milliseconds
const int MAX_RETRIES = 3;

// Secrets pulled from private.h file
EspMQTTClient mqtt(
    secret_wifi_ssid,     // Your Wifi SSID
    secret_wifi_password, // Your WiFi key
    secret_mqtt_server,   // MQTT Broker server ip
    secret_mqtt_username, // MQTT Username Can be omitted if not needed
    secret_mqtt_password, // MQTT Password Can be omitted if not needed
    secret_clientName,    // MQTT Client name that uniquely identify your device
    1883                  // MQTT Broker server port
);

const char jsonTemplate[] = "{ "
                            "\"liters\": %d, "
                            "\"counter\" : %d, "
                            "\"battery\" : %d, "
                            "\"rssi\" : %d, "
                            "\"timestamp\" : \"%s\" }";

int _retry = 0;

// Global variable to store the reading schedule (default from private.h)
String readingSchedule = DEFAULT_READING_SCHEDULE;

// Function to check if today is within the configured schedule
bool isReadingDay(struct tm *ptm) {
  if (readingSchedule == "Monday-Friday") {
    return ptm->tm_wday >= 1 && ptm->tm_wday <= 5; // Monday to Friday
  } else if (readingSchedule == "Monday-Saturday") {
    return ptm->tm_wday >= 1 && ptm->tm_wday <= 6; // Monday to Saturday
  } else if (readingSchedule == "Monday-Sunday") {
    return true; // Every day
  }
  return false;
}

// Function to scan for the correct frequency in the 433 MHz range
void scanFrequency433MHz() {
  Serial.printf("###### FREQUENCY DISCOVERY ENABLED (433 MHz) ######\nStarting Frequency Scan...\n");
  for (float i = 433.76f; i < 433.890f; i += 0.0005f) {
      Serial.printf("Test frequency : %f\n", i);
      cc1101_init(i);
      struct tmeter_data meter_data = get_meter_data();
      if (meter_data.reads_counter != 0 || meter_data.liters != 0) {
          Serial.printf("\n------------------------------\nGot frequency : %f\n------------------------------\n", i);
          Serial.printf("Liters : %d\nBattery (in months) : %d\nCounter : %d\n\n", meter_data.liters, meter_data.battery_left, meter_data.reads_counter);
          digitalWrite(LED_BUILTIN, LOW); // turned on
          while (42); // Stop execution once frequency is found
      }
  }
  Serial.printf("###### FREQUENCY DISCOVERY FINISHED (433 MHz) ######\nOnce you have discovered the correct frequency you can disable this scan.\n\n");
}


// Function: calculateWiFiSignalStrengthPercentage
// Description: Converts RSSI to a percentage value (0-100%).
int calculateWiFiSignalStrengthPercentage(int rssi) {
  int strength = constrain(rssi, -100, -50); // Clamp RSSI to a reasonable range
  return map(strength, -100, -50, 0, 100);   // Map RSSI to percentage (0-100%)
}

// Function: calculateMeterdBmToPercentage
// Description: Converts 433 MHz RSSI (dBm) to a percentage (0-100%).
int calculateMeterdBmToPercentage(int rssi_dbm) {
  // Clamp RSSI to a reasonable range (e.g., -120 dBm to -40 dBm)
  int clamped_rssi = constrain(rssi_dbm, -120, -40);
  
  // Map the clamped RSSI value to a percentage (0-100%)
  return map(clamped_rssi, -120, -40, 0, 100);
}

// Function: calculateLQIToPercentage
// Description: Converts LQI (Link Quality Indicator) to a percentage (0-100%).
int calculateLQIToPercentage(int lqi) {
  int strength = constrain(lqi, 0, 255); // Clamp LQI to valid range
  return map(strength, 0, 255, 0, 100);  // Map LQI to percentage
}

// Helper: let MQTT client send queued messages and feed watchdog (avoids restart from buffer overload)
static void mqttFlush(unsigned int ms) {
  for (unsigned int t = 0; t < ms; t += 10) {
    mqtt.loop();
    yield();
    ESP.wdtFeed();
    delay(10);
  }
}

// Function: onUpdateData
// Description: Fetches data from the water meter and publishes it to MQTT topics.
//              Retries up to 3 times if data retrieval fails, then enters 1-hour cooldown.
void onUpdateData()
{
  // Check if we're still in cooldown period
  if (cooldownEndTime > 0 && millis() < cooldownEndTime) {
    unsigned long remainingTime = (cooldownEndTime - millis()) / 1000; // seconds
    Serial.printf("Meter reading blocked - cooldown active. %lu seconds remaining.\n", remainingTime);
    
    // Publish cooldown status to MQTT
    String cooldownMsg = "Cooldown active - " + String(remainingTime / 60) + " minutes remaining";
    mqtt.publish("everblu/cyble/status", cooldownMsg, true);
    return;
  }
  
  // Reset cooldown if period has expired
  if (cooldownEndTime > 0 && millis() >= cooldownEndTime) {
    cooldownEndTime = 0;
    Serial.println("Cooldown period expired. Meter reading requests now allowed.");
    mqtt.publish("everblu/cyble/status", "Ready - cooldown expired", true);
  }

  Serial.printf("Updating data from meter...\n");
  Serial.printf("Retry count : %d\n", _retry);
  Serial.printf("Reading schedule : %s\n", readingSchedule.c_str());

