jakubczaplicki/everblu-meters-esp8266-improved/src/everblu-meters-esp8266.cpp
  // Indicate activity with LED
  digitalWrite(LED_BUILTIN, LOW); // Turn on LED to indicate activity

  // CONSERVATIVE APPROACH: Reduce WiFi interference without complete shutdown
  Serial.println("Reducing WiFi interference for RF operations...");
  
  // Pause MQTT and reduce WiFi activity instead of complete disable
  WiFi.setOutputPower(0); // Reduce WiFi transmission power temporarily
  yield(); ESP.wdtFeed();
  
  // Fresh CC1101 initialization like the successful scanner  
  Serial.println("Reinitializing CC1101 for clean RF state...");
  cc1101_init(FREQUENCY);
  yield(); ESP.wdtFeed();
  
  // Brief delay to settle RF state
  delay(50);
  ESP.wdtFeed();
  
  // Clean RF measurement with minimal WiFi interference
  // Try standard approach first, then frequency scanning if it fails
  Serial.println("Attempting meter reading with configured frequency...");
  struct tmeter_data meter_data = get_meter_data(); // Fetch meter data
  
  // If standard approach failed, try frequency scanning
  if (meter_data.reads_counter == 0 && meter_data.liters == 0) {
    Serial.println("🔍 Standard frequency failed - starting intelligent frequency scan...");
    Serial.println("This may take 2-3 minutes to test multiple frequencies");
    meter_data = get_meter_data_with_frequency_scan();
  }
  
  // Restore full WiFi power after RF operations
  Serial.println("Restoring full WiFi power...");
  WiFi.setOutputPower(20.5); // Restore full WiFi power (max for ESP8266)
  yield(); ESP.wdtFeed();
  
  // Ensure MQTT is still connected (should be since we never fully disconnected)
  if (!mqtt.isConnected()) {
    Serial.println("MQTT disconnected during RF operations, reconnecting...");
    // Don't force reconnect - let the MQTT library handle it naturally
    yield(); ESP.wdtFeed();
  }
  
  Serial.println("Starting MQTT data publication...");
  yield(); ESP.wdtFeed();
  mqtt.publish("everblu/cyble/active_reading", "false", true);

  // Get current UTC time
  time_t tnow = time(nullptr);
  struct tm *ptm = gmtime(&tnow);
  Serial.printf("Current date (UTC) : %04d/%02d/%02d %02d:%02d/%02d - %s\n", ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, ptm->tm_hour, ptm->tm_min, ptm->tm_sec, String(tnow, DEC).c_str());

  char iso8601[128];
  strftime(iso8601, sizeof iso8601, "%FT%TZ", gmtime(&tnow));

  // Handle data retrieval failure
  if (meter_data.reads_counter == 0 || meter_data.liters == 0) {
    Serial.println("Unable to retrieve data from meter. Retry later...");
    if (_retry < MAX_RETRIES) {
      _retry++;
      retryPending = true;
      lastRetryAttempt = millis();
    } else {
      Serial.printf("Max retries (%d) reached. Entering 1-hour cooldown period.\n", MAX_RETRIES);
      cooldownEndTime = millis() + COOLDOWN_PERIOD;
      _retry = 0; // Reset for next trigger
      Serial.println("Next meter reading allowed after cooldown period expires.");
      
      // Notify Home Assistant about cooldown
      mqtt.publish("everblu/cyble/status", "Max retries reached - entering 1-hour cooldown", true);
    }
    return;
  }

  
  // Format int time_start and time_end as "HH:MM"
  char timeStartFormatted[6];
  char timeEndFormatted[6];
  int timeStart = constrain(meter_data.time_start, 0, 23); // Ensure valid hour range
  int timeEnd = constrain(meter_data.time_end, 0, 23);     // Ensure valid hour range
  snprintf(timeStartFormatted, sizeof(timeStartFormatted), "%02d:00", timeStart);
  snprintf(timeEndFormatted, sizeof(timeEndFormatted), "%02d:00", timeEnd);

  Serial.printf("Data from meter:\n");
  Serial.printf("Liters : %d\nBattery (in months) : %d\nCounter : %d\nRSSI : %d\nTime start : %s\nTime end : %s\n\n", meter_data.liters, meter_data.battery_left, meter_data.reads_counter, meter_data.rssi, timeStartFormatted, timeEndFormatted);
  Serial.printf("RSSI (dBm) : %d\n", meter_data.rssi_dbm);
  Serial.printf("RSSI (percentage) : %d\n", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  Serial.printf("Signal quality (LQI) : %d\n", meter_data.lqi);
  Serial.printf("Signal quality (LQI percentage) : %d\n", calculateLQIToPercentage(meter_data.lqi));

  // Publish meter data to MQTT (static buffer avoids heap fragmentation / restart)
  static char buf[24];
  snprintf(buf, sizeof(buf), "%d", meter_data.liters);
  mqtt.publish("everblu/cyble/liters", buf, true);
  snprintf(buf, sizeof(buf), "%d", meter_data.reads_counter);
  mqtt.publish("everblu/cyble/counter", buf, true);
  snprintf(buf, sizeof(buf), "%d", meter_data.battery_left);
  mqtt.publish("everblu/cyble/battery", buf, true);
  mqttFlush(40);

  snprintf(buf, sizeof(buf), "%d", meter_data.rssi_dbm);
  mqtt.publish("everblu/cyble/rssi_dbm", buf, true);
  snprintf(buf, sizeof(buf), "%d", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  mqtt.publish("everblu/cyble/rssi_percentage", buf, true);
  snprintf(buf, sizeof(buf), "%d", meter_data.lqi);
  mqtt.publish("everblu/cyble/lqi", buf, true);
  mqtt.publish("everblu/cyble/time_start", timeStartFormatted, true);
  mqtt.publish("everblu/cyble/time_end", timeEndFormatted, true);
  mqtt.publish("everblu/cyble/timestamp", iso8601, true);
  snprintf(buf, sizeof(buf), "%d", calculateLQIToPercentage(meter_data.lqi));
  mqtt.publish("everblu/cyble/lqi_percentage", buf, true);
  mqttFlush(40);

  if (meter_data.successful_frequency > 0.0f && ESP.getFreeHeap() > 5000) {
    snprintf(buf, sizeof(buf), "%.6f", (double)meter_data.successful_frequency);
    mqtt.publish("everblu/cyble/successful_frequency", buf, true);
    mqttFlush(30);
  }

  // Optional: single JSON payload (skip if low memory to avoid crash)
  if (ESP.getFreeHeap() > 3000) {
    static char json[256];
    snprintf(json, sizeof(json), jsonTemplate, meter_data.liters, meter_data.reads_counter, meter_data.battery_left, meter_data.rssi, iso8601);
    mqtt.publish("everblu/cyble/json", json, true);
  }

  mqtt.publish("everblu/cyble/status", "online", true);
  mqttFlush(120);  // Let queue drain and feed watchdog before returning

  // Note: active_reading "false" already published at line 207 - no need to duplicate
  
