jakubczaplicki/everblu-meters-esp8266-improved/src/everblu-meters-esp8266.cpp
  // Publish MQTT discovery messages for the Restart Button
  mqtt.publish("homeassistant/button/water_meter_restart/config", FPSTR(jsonDiscoveryRestartButton), true);
  delay(50);

  // Publish MQTT discovery message for the binary sensor
  mqtt.publish("homeassistant/binary_sensor/water_meter_active_reading/config", FPSTR(jsonDiscoveryActiveReading), true);
  delay(50);

  // Publish MQTT discovery messages for Meter Year, Serial, and Frequency
  mqtt.publish("homeassistant/sensor/water_meter_year/config", FPSTR(jsonDiscoveryMeterYear), true);
  delay(50);
  mqtt.publish("homeassistant/sensor/water_meter_serial/config", FPSTR(jsonDiscoveryMeterSerial), true);
  delay(50);
  mqtt.publish("homeassistant/sensor/water_meter_frequency/config", FPSTR(jsonDiscoveryFrequency), true);
  delay(50);

  // Publish JSON discovery for Reading Schedule
  mqtt.publish("homeassistant/sensor/water_meter_reading_schedule/config", FPSTR(jsonDiscoveryReadingSchedule), true);
  delay(50);

  // Publish JSON discovery for Battery Months Left
  mqtt.publish("homeassistant/sensor/water_meter_battery_months/config", FPSTR(jsonDiscoveryBatteryMonths), true);
  delay(50);

  // Publish JSON discovery for Meter RSSI (dBm), RSSI (%), and LQI (%)
  mqtt.publish("homeassistant/sensor/water_meter_rssi_dbm/config", FPSTR(jsonDiscoveryMeterRSSIDBm), true);
  delay(50);
  mqtt.publish("homeassistant/sensor/water_meter_rssi_percentage/config", FPSTR(jsonDiscoveryMeterRSSIPercentage), true);
  delay(50);
  mqtt.publish("homeassistant/sensor/water_meter_lqi_percentage/config", FPSTR(jsonDiscoveryLQIPercentage), true);
  delay(50);

  // Publish JSON discovery for the times the meter wakes and sleeps
  mqtt.publish("homeassistant/sensor/water_meter_time_start/config", FPSTR(jsonDiscoveryTimeStart), true);
  delay(50);
  mqtt.publish("homeassistant/sensor/water_meter_time_end/config", FPSTR(jsonDiscoveryTimeEnd), true);
  delay(50);

  // Set initial state for active reading
  mqtt.publish("everblu/cyble/active_reading", "false", true);
  delay(50);

  Serial.println("> MQTT config sent");

  // Publish initial Wi-Fi details
  publishWifiDetails();

  // Publish once the meter settings as set in the softeware
  publishMeterSettings();

  // Turn off LED to show everything is setup
  digitalWrite(LED_BUILTIN, HIGH); // turned off

  Serial.println("> Setup done");
  
  // =====================================================
  // POST-SETUP HEALTH CHECK
  // =====================================================
  String separator = "";
  for(int i = 0; i < 60; i++) separator += "=";
  
  Serial.println("\n" + separator);
  Serial.println("✅ POST-SETUP SYSTEM VERIFICATION");
  Serial.println(separator);
  
  // 1. WiFi Connection Verification
  Serial.println("\n📡 WIFI STATUS:");
  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("  • SSID: %s ✅\n", WiFi.SSID().c_str());
    Serial.printf("  • IP Address: %s ✅\n", WiFi.localIP().toString().c_str());
    Serial.printf("  • Signal Strength: %d dBm (%d%%) ✅\n", WiFi.RSSI(), calculateWiFiSignalStrengthPercentage(WiFi.RSSI()));
    Serial.printf("  • MAC Address: %s ✅\n", WiFi.macAddress().c_str());
  } else {
    Serial.println("  • WiFi Status: ❌ DISCONNECTED");
  }
  
  // 2. MQTT Connection Verification
  Serial.println("\n📨 MQTT STATUS:");
  if (mqtt.isConnected()) {
    Serial.printf("  • Broker: %s ✅\n", secret_mqtt_server);
    Serial.printf("  • Client Name: %s ✅\n", secret_clientName);
    Serial.println("  • Connection: ✅ Connected and operational");
    Serial.println("  • Home Assistant Discovery: ✅ Published");
  } else {
    Serial.println("  • MQTT Status: ❌ DISCONNECTED");
  }
  
  // 3. OTA Service Status
  Serial.println("\n🔄 OTA SERVICE:");
  Serial.printf("  • Hostname: EVERBLUREADER ✅\n");
  Serial.printf("  • Status: ✅ Ready for wireless updates\n");
  
  // 4. CC1101 Final Verification
  Serial.println("\n📡 CC1101 RADIO:");
  Serial.printf("  • Frequency: %.6f MHz ✅\n", FREQUENCY);
  Serial.printf("  • Target Meter: %02d-0%d ✅\n", METER_YEAR, METER_SERIAL);
  Serial.printf("  • Radio Status: ✅ Initialized and ready\n");
  
  // 5. Memory Status After Initialization
  Serial.println("\n💾 FINAL MEMORY STATUS:");
  uint32_t finalHeap = ESP.getFreeHeap();
  Serial.printf("  • Free Heap: %d bytes\n", finalHeap);
  if (finalHeap > 15000) {
    Serial.println("  • Memory Status: ✅ Excellent (Stable operation expected)");
  } else if (finalHeap > 10000) {
    Serial.println("  • Memory Status: ✅ Good (Normal operation)");
  } else if (finalHeap > 6000) {
    Serial.println("  • Memory Status: ⚠️ Acceptable (Monitor for stability)");
  } else {
    Serial.println("  • Memory Status: ❌ Low (May cause instability)");
  }
  
  // 6. Time and Schedule Verification
  Serial.println("\n⏰ TIME & SCHEDULE:");
  tnow = time(nullptr);
  ptm = gmtime(&tnow);
  Serial.printf("  • Current Time: %04d/%02d/%02d %02d:%02d:%02d UTC ✅\n", 
    ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, ptm->tm_hour, ptm->tm_min, ptm->tm_sec);
  Serial.printf("  • Reading Schedule: %s ✅\n", DEFAULT_READING_SCHEDULE);
  
  // Determine if it's currently a reading day and time
  bool isReading = isReadingDay(ptm);
  bool isBusinessHours = (ptm->tm_hour >= 8 && ptm->tm_hour < 18); // 8 AM to 6 PM UTC
  if (isReading && isBusinessHours) {
    Serial.println("  • Meter Availability: ✅ Should be available now");
  } else if (isReading && !isBusinessHours) {
    Serial.println("  • Meter Availability: ⏰ Available weekday but outside business hours");
  } else {
    Serial.println("  • Meter Availability: ⏰ Weekend/Holiday - meter sleeping");
  }
  
  // 7. Final System Health Summary
  Serial.println("\n📋 FINAL SYSTEM STATUS:");
  bool systemHealthy = true;
  String healthIssues = "";
  
  if (WiFi.status() != WL_CONNECTED) {
    systemHealthy = false;
    healthIssues += "WiFi disconnected; ";
  }
  
  if (!mqtt.isConnected()) {
    systemHealthy = false;
    healthIssues += "MQTT disconnected; ";
  }
  
  if (finalHeap < 6000) {
    systemHealthy = false;
    healthIssues += "Critical memory shortage; ";
  }
  
  if (systemHealthy) {
    Serial.println("  🎉 ALL SYSTEMS FULLY OPERATIONAL!");
    Serial.println("  ✅ WiFi Connected");
    Serial.println("  ✅ MQTT Connected"); 
    Serial.println("  ✅ CC1101 Radio Ready");
    Serial.println("  ✅ Home Assistant Integration Active");
    Serial.println("  ✅ OTA Updates Ready");
    Serial.println("  ✅ Scheduled Readings Configured");
  } else {
    Serial.printf("  ⚠️ SYSTEM ISSUES DETECTED: %s\n", healthIssues.c_str());
    Serial.println("  📞 Check network connections and restart if needed");
  }
  
  Serial.println(separator);
  Serial.println("🚀 WATER METER MONITORING SYSTEM READY!");
  Serial.println(separator + "\n");
  
