jakubczaplicki/everblu-meters-esp8266-improved/src/everblu-meters-esp8266.cpp
  // =====================================================
  // END POST-SETUP HEALTH CHECK
  // =====================================================

  Serial.println("Ready to go...");

  onScheduled();
}

// Function: setup
// Description: Initializes the device, including serial communication, Wi-Fi, MQTT, and frequency discovery.
void setup()
{
  Serial.begin(115200);
  Serial.println("\n");
  Serial.println("Everblu Meters ESP8266 Starting...");
  Serial.println("Water usage data for Home Assistant");
  Serial.println("https://github.com/genestealer/everblu-meters-esp8266-improved");
  String meterinfo = "Target meter: " + String(METER_YEAR, DEC) + "-0" + String(METER_SERIAL, DEC) + "\nTarget frequency: " + String(FREQUENCY, DEC) + "\n";
  Serial.println(meterinfo);

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW); // turned on to start with

  // Increase the max packet size to handle large MQTT payloads
  mqtt.setMaxPacketSize(2048); // Set to a size larger than your longest payload

  // Set the Last Will and Testament (LWT)
  mqtt.enableLastWillMessage("everblu/cyble/status", "offline", true);  // You can activate the retain flag by setting the third parameter to true

  // Conditionally enable Wi-Fi PHY mode 11G.  Set this in private.h to 0 to disable.
  #if ENABLE_WIFI_PHY_MODE_11G
  WiFi.setPhyMode(WIFI_PHY_MODE_11G);
  Serial.println("Wi-Fi PHY mode set to 11G.");
  #else
  Serial.println("> Wi-Fi PHY mode 11G is disabled.");
  #endif

  // Log the reading schedule
  Serial.printf("> Reading schedule: %s\n", DEFAULT_READING_SCHEDULE);

  // Optional functionalities of EspMQTTClient
  // mqtt.enableDebuggingMessages(true); // Enable debugging messages sent to serial output

  // Conditionally enable scan for meter on 433 MHz. Set this in private.h to 1 to enable.  Only needed to find the frequency of the meter once.
  #if SCAN_FREQUENCY_433MHZ
  scanFrequency433MHz();
  #endif

  // =====================================================
  // INITIAL SYSTEM DIAGNOSTICS
  // =====================================================
  String separator = "";
  for(int i = 0; i < 60; i++) separator += "=";
  
  Serial.println("\n" + separator);
  Serial.println("🔍 SYSTEM SELF-DIAGNOSTICS");
  Serial.println(separator);
  
  // 1. System Information
  Serial.println("\n📊 SYSTEM INFO:");
  Serial.printf("  • Chip ID: %08X\n", ESP.getChipId());
  Serial.printf("  • CPU Frequency: %d MHz\n", ESP.getCpuFreqMHz());
  Serial.printf("  • Free Heap: %d bytes\n", ESP.getFreeHeap());
  Serial.printf("  • Flash Size: %d bytes\n", ESP.getFlashChipSize());
  Serial.printf("  • Sketch Size: %d bytes\n", ESP.getSketchSize());
  Serial.printf("  • Free Sketch Space: %d bytes\n", ESP.getFreeSketchSpace());
  
  // 2. Pin Configuration Check
  Serial.println("\n🔌 PIN CONFIGURATION:");
  Serial.printf("  • GDO0 Pin: D1 (GPIO%d)\n", GDO0);
  Serial.printf("  • CS Pin: D8 (GPIO15)\n");
  Serial.printf("  • SCK Pin: D5 (GPIO14)\n");
  Serial.printf("  • MOSI Pin: D7 (GPIO13)\n");
  Serial.printf("  • MISO Pin: D6 (GPIO12)\n");
  
  // 3. CC1101 Hardware Test
  Serial.println("\n🔧 CC1101 HARDWARE TEST:");
  
  // Test 1: SPI Communication Test
  Serial.print("  • SPI Communication: ");
  delay(100);
  
  // Basic SPI test (this will be overridden by cc1101_init later)
  pinMode(15, OUTPUT); // CS pin
  digitalWrite(15, HIGH);
  
  // Simple connection test
  bool spi_ok = (digitalRead(15) == HIGH); // Basic pin test
  
  if (spi_ok) {
    Serial.println("✅ OK (Pin connections verified)");
  } else {
    Serial.println("❌ FAILED (Check pin connections)");
  }
  
  // Test 2: Power Supply Check
  Serial.print("  • Power Supply: ");
  Serial.println("✅ OK (ESP8266 powered, assuming 3.3V OK)");
  
  // Test 3: Pin Connectivity
  Serial.println("  • Pin Status:");
  pinMode(GDO0, INPUT_PULLUP);
  Serial.printf("    - GDO0 (D1): %s\n", digitalRead(GDO0) ? "HIGH" : "LOW");
  Serial.printf("    - CS (D8): %s\n", digitalRead(15) ? "HIGH" : "LOW");
  
  // 4. Meter Configuration
  Serial.println("\n🎯 METER CONFIGURATION:");
  Serial.printf("  • Target Meter: %02d-0%d\n", METER_YEAR, METER_SERIAL);
  Serial.printf("  • Frequency: %.6f MHz\n", FREQUENCY);
  Serial.printf("  • Reading Schedule: %s\n", DEFAULT_READING_SCHEDULE);
  
  // 5. Memory Health Check (Improved thresholds for ESP8266)
  Serial.println("\n💾 MEMORY HEALTH:");
  uint32_t freeHeap = ESP.getFreeHeap();
  Serial.printf("  • Free Heap: %d bytes\n", freeHeap);
  if (freeHeap > 25000) {
    Serial.println("  • Memory Status: ✅ Excellent");
  } else if (freeHeap > 15000) {
    Serial.println("  • Memory Status: ✅ Good (Normal for ESP8266)");
  } else if (freeHeap > 8000) {
    Serial.println("  • Memory Status: ⚠️ Low (Monitor for issues)");
  } else {
    Serial.println("  • Memory Status: ❌ Critical (Very low memory)");
  }
  
  // 6. Initial Diagnostic Summary
  Serial.println("\n📋 INITIAL DIAGNOSTICS:");
  bool hardwareOk = true;
  
  if (!spi_ok) {
    Serial.println("  ❌ SPI pin configuration failed");
    hardwareOk = false;
  }
  
  if (freeHeap < 8000) {
    Serial.println("  ❌ Critical memory shortage detected");
    hardwareOk = false;
  }
  
  if (hardwareOk) {
    Serial.println("  ✅ Hardware checks passed!");
  } else {
    Serial.println("  ⚠️ Hardware issues detected - check above for details");
  }
  
  Serial.println(separator);
  Serial.println("🚀 STARTING WATER METER SYSTEM...");
  Serial.println(separator + "\n");
  
  // =====================================================
  // END INITIAL DIAGNOSTICS
  // =====================================================
    
  // Set CC1101 radio frequency
  cc1101_init(FREQUENCY);

}

// Function: loop
// Description: Main loop to handle MQTT and OTA operations, and update diagnostics periodically.
void loop() {
  mqtt.loop();
  ArduinoOTA.handle();
  
  // Handle retry attempts (non-recursive approach)
  if (retryPending && (millis() - lastRetryAttempt > 10000)) { // 10 seconds between retries
    retryPending = false;
    onUpdateData();
  }

  // Update diagnostics and Wi-Fi details every 5 minutes
  if (millis() - lastWifiUpdate > 300000) { // 5 minutes in ms
    publishWifiDetails();
    lastWifiUpdate = millis();
  }
  
  // Feed watchdog in main loop to prevent resets
  ESP.wdtFeed();
}
